<h1 align = "center">Pandas</h1>

### pandas is an open source library built ontop of numpy

### It allows fast analysis and data cleaning and preparation

### It excells in perfomance and productiviy

### It also has built in visualization features

### It can work with data, from wide variety of sources

<h2 align = "center"> series </h2>

A series is very familiar to a numpy array, infact  it's built ontop of it

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [7]:
labels = ["one","two","three"]
my_data = [10,20,30]
arr = np.array(my_data)
dic = {"1":"a","2":"b","3":"c"}

In [8]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data = my_data, index = labels)

one      10
two      20
three    30
dtype: int64

In [11]:
pd.Series(my_data,labels)

one      10
two      20
three    30
dtype: int64

In [12]:
pd.Series(dic)

1    a
2    b
3    c
dtype: object

In [13]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

#### We can also do the following. By passing the data in realtime

In [17]:
ser1 = pd.Series([1,2,3,4],["Tanzania","India","Japan","Korea"])

In [18]:
ser1

Tanzania    1
India       2
Japan       3
Korea       4
dtype: int64

In [19]:
ser2 = pd.Series([1,2,3,4],["Tanzania","Kenya","Uganda","Tanzania"])

In [20]:
ser2

Tanzania    1
Kenya       2
Uganda      3
Tanzania    4
dtype: int64

### Accesing Pandas series

In [24]:
ser1["Tanzania"]

1

In [25]:
ser2["Kenya"]

2

In [28]:
ser3 = pd.Series(data=labels)

In [29]:
ser3

0      one
1      two
2    three
dtype: object

In [30]:
ser3[0]

'one'

#### List Operation

In [32]:
ser1

Tanzania    1
India       2
Japan       3
Korea       4
dtype: int64

In [36]:
ser2 = pd.Series([1,2,3,4],["Tanzania","Kenya","Uganda","Burundi"])

In [37]:
ser2

Tanzania    1
Kenya       2
Uganda      3
Burundi     4
dtype: int64

In [38]:
ser1 + ser2

Burundi     NaN
India       NaN
Japan       NaN
Kenya       NaN
Korea       NaN
Tanzania    2.0
Uganda      NaN
dtype: float64

<h2 align = "center"> DataFrames </h2>

In [4]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### indexing and selection

In [9]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df["W"])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

* to view multiple columns

In [12]:
df[["W","X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

* That brings back a dataframe!!

* we can also create a new collumn. the following is how to

In [13]:
df["new"] = df["W"] + df["Y"]

In [14]:
df["new"]

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

* In order to delete a column, we use df.drop("column_name",axis=1) ## axis = 0,is for rows, and axis = 1 is for columns

In [16]:
    df.drop("new", axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

* After i called the df element again. We can see the column "new".is not deleted

* Now in order to completely remove the column, then we have to include another argument, inplace=True

In [18]:
df.drop("new",axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

* Now the new column is removed..

* we can also drop rows using the same syntax, but the axis argument equals to zero

In [20]:
df.drop("C",axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

* Now if we realy want to delete the row permanently,then we have to allow the the argument of inplace =True

In [22]:
df.drop("C",axis=0,inplace = True)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.shape

(4, 4)

In [25]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [26]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

<b><i> Now let's refresh on how to select columns </i></b>

In [27]:
df[["X","Y"]]

          X         Y
A  1.693723 -1.706086
B  0.390528  0.166905
C  0.072960  0.638787
D -0.754070 -0.943406
E  1.901755  0.238127

* Now there are two main ways of selecting rows in a dataframe

Method1

In [28]:
df.loc["A"]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

* Now here we used label based index ...

Method2

In [29]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

* Now here we used the numerical based index ...

Now, we can do more selection practices .....

In [30]:
df.loc["A","X"]

1.693722925204035

In [31]:
df.loc["A":,"X"]

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [32]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [33]:
df.loc["B":"D","X":"Z"]

          X         Y         Z
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752

In [34]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A  1.693723 -1.706086
B  0.390528  0.166905

<h1 align="center"> Conditional Selection </h1>

In [35]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [36]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [37]:
bool_greater = df>0

In [38]:
bool_greater

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [39]:
df[bool_greater]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [40]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [42]:
booldf = df > 0

In [43]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [44]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

* the NaN signifies that the thingy is false

* In order to get all the values needed by the conditional operator.Then we need to do it as following

In [48]:
df["X"]>0

A     True
B     True
C     True
D    False
E     True
Name: X, dtype: bool

* Returns the columns which corresponding to the condition

Now we can use the folowing syntax to filter out rows which accept the condition i've put below

In [49]:
df[df["W"]>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

* Now for example i want to grab all the rows in a dataframe where Z is less than 0

In [50]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [51]:
df[df["Z"]<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

* Doing filtering out rows and perfoming comands in a subset of the whole dataframe

In [52]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [54]:
df[df["X"]>0]["W"]

A    0.302665
B   -0.134841
C    0.807706
E   -0.116773
Name: W, dtype: float64

* To return more than one column in a same condition dome above, here is what we can do

In [55]:
df[df["X"]>0][["W","Z"]]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
E -0.116773  1.996652

In [56]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

* Multiple conditions data frames selection and indexing

df[(df["X"]>0) and (df["Y"]>1)] 
--> This is where we tried to put a conditional operator on two pandas DataFrames

* Now we can do it using the ampasand operator

In [63]:
df[(df["X"]>0) & (df["Y"]>0)]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

* So if you need to use multiple condition in pandas u need to use "&" and not "and"

* For an or operation we can use a pipe operator "|"

In [64]:
df[(df["X"]>0) | (df["Y"]>0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [65]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

<h3 align="center"> Index </h3>

* Now lets take a look at our original DataFrame

In [67]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In order to reset the index to the default value we have to use the following syntax..

### df.reset_index()

In [68]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [69]:

df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [70]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

Now if you want the change to take place, we add the argument inplace = True

* plus the old index becomes stored as one of the column named index

* now lets create a new index for our dataframe

In [71]:
newind = "DAR MWN MBY DOM MRA".split()

In [72]:
newind

['DAR', 'MWN', 'MBY', 'DOM', 'MRA']

In [73]:
df["Regions"] = newind

In [74]:
df

          W         X         Y         Z Regions
A  0.302665  1.693723 -1.706086 -1.159119     DAR
B -0.134841  0.390528  0.166905  0.184502     MWN
C  0.807706  0.072960  0.638787  0.329646     MBY
D -0.497104 -0.754070 -0.943406  0.484752     DOM
E -0.116773  1.901755  0.238127  1.996652     MRA

to set a new index for the dataframe we use the following syntax

In [75]:
df

          W         X         Y         Z Regions
A  0.302665  1.693723 -1.706086 -1.159119     DAR
B -0.134841  0.390528  0.166905  0.184502     MWN
C  0.807706  0.072960  0.638787  0.329646     MBY
D -0.497104 -0.754070 -0.943406  0.484752     DOM
E -0.116773  1.901755  0.238127  1.996652     MRA

In [76]:
df.set_index("Regions")

                W         X         Y         Z
Regions
DAR      0.302665  1.693723 -1.706086 -1.159119
MWN     -0.134841  0.390528  0.166905  0.184502
MBY      0.807706  0.072960  0.638787  0.329646
DOM     -0.497104 -0.754070 -0.943406  0.484752
MRA     -0.116773  1.901755  0.238127  1.996652

In [77]:
df

          W         X         Y         Z Regions
A  0.302665  1.693723 -1.706086 -1.159119     DAR
B -0.134841  0.390528  0.166905  0.184502     MWN
C  0.807706  0.072960  0.638787  0.329646     MBY
D -0.497104 -0.754070 -0.943406  0.484752     DOM
E -0.116773  1.901755  0.238127  1.996652     MRA

In [79]:
df

          W         X         Y         Z Regions
A  0.302665  1.693723 -1.706086 -1.159119     DAR
B -0.134841  0.390528  0.166905  0.184502     MWN
C  0.807706  0.072960  0.638787  0.329646     MBY
D -0.497104 -0.754070 -0.943406  0.484752     DOM
E -0.116773  1.901755  0.238127  1.996652     MRA

<h1 align = "center"> DataFrames Part 3 </h1>

In [11]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [12]:
# Index levels

outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [13]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [14]:
inside

[1, 2, 3, 1, 2, 3]

In [15]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

* Note the pd.MultiIndex.from_tuples is a method that takes in values of list of tuples to make a customised multi-index dataframes

In [16]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [17]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [18]:
df = pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [19]:
df

             A         B
G1 1 -0.314137  1.289344
   2  0.471385  1.374689
   3 -0.102768  1.482950
G2 1  0.551081  0.216814
   2  1.391389 -0.946775
   3 -0.515617  0.029653

In [23]:
df.loc["G1"]

          A         B
1 -0.314137  1.289344
2  0.471385  1.374689
3 -0.102768  1.482950

In [26]:
df.loc["G2"]

          A         B
1  0.551081  0.216814
2  1.391389 -0.946775
3 -0.515617  0.029653

* In order to name lists we need to do the following

In [28]:
df.index.names= ["Groups","num"]

In [29]:
df

                   A         B
Groups num
G1     1   -0.314137  1.289344
       2    0.471385  1.374689
       3   -0.102768  1.482950
G2     1    0.551081  0.216814
       2    1.391389 -0.946775
       3   -0.515617  0.029653

* Another way to acces info within the multi-index list

now lets try to acces the group G2

In [31]:
df.loc["G2"]

            A         B
num
1    0.551081  0.216814
2    1.391389 -0.946775
3   -0.515617  0.029653

In [30]:
df.loc["G2"]["A"]

num
1    0.551081
2    1.391389
3   -0.515617
Name: A, dtype: float64

* Lets try to selct deeper within the list

In [39]:
df.loc["G2"].loc[2:"A"]

            A         B
num
2    1.391389 -0.946775
3   -0.515617  0.029653

In [41]:
df.loc["G1"].loc[1,"A"]

-0.3141370504593401

#### Another way of accessing the multi-index element is useing the function #### .xs(), also known by the cros-section

In [42]:
df.xs("G1")

            A         B
num
1   -0.314137  1.289344
2    0.471385  1.374689
3   -0.102768  1.482950

* For example if we want to grab all the ones from both G1 and G2 , here is what we do

In [43]:
df.xs(1,level="num")

               A         B
Groups
G1     -0.314137  1.289344
G2      0.551081  0.216814

<h1 align="center">Missing Data</h1>

* Normally when u are reading data or in-data,if u have a missing value or point  in your data, pandas will term or fill that missing point with a null or any end value. Now we'll learn how methods like drop NaN or fill NaN, to help on filling those values

In [45]:
import numpy as np
import pandas as pd

Now we gonna create a dataframe from a dictionary

In [46]:
d = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

now let's create our dataframe and pass in our dictionary "d"

In [47]:
df = pd.DataFrame(d)

In [48]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### .dropna() method

* Now by doing this,pandas is going to drop all the cells with missing values, and leaving all those with known value

In [50]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [51]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [54]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

* as usual, when axis equals to one, it means the drop values will act in collumns. when zero, it acts in rows

* About the thresh argument in the df.dropna(thresh). so basically, it vumiliaz mpaka a certain number of nan values is met then it drops, consider the following example .....

In [55]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

now, the last row was deleted because, it contained the exactly two NaN values in the the row. But the middle row didn't have two or more NaN values, hence left to stay

#### .fillna( ) method

* Now here is when we want to fill in the missing values. as its attributes, there is an attribute named value in it..

In [56]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

* Now consider the above dataframe.....

* Now i will fill the values where there is NaN with some random test

In [59]:
df.fillna(value="Fill Value")

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

* Now most of the times you may want to fill those missing values maybe with the mean of that collumn

In [60]:
df["A"]

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [62]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

* Now that empty value is now filled with the mean of the collumn

* There are alot of philosopy and ideas of filling up data according to the data you're working with.. now this will be done also more on later

<h1 align="center"> Groupby </h1>

* In this lecture we're going to show how to use the groupby method to light a group of data and call aggregate functions

* Groupy allows the user to group rows based of a column and then perform some kind of aggregate function

* An aggregate function is any function that takes many value and spits out one end results

In [64]:
import pandas as pd
import numpy as np

In [65]:
data = {"company":["GOOG","GOOG","MSFT","MSFT","FB","FB"],"Person":["Amani","Tina","Succes","Johari","Philomena","Joseph"],"Sales":[233,456,421,938,234,111]}

In [66]:
data

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Amani', 'Tina', 'Succes', 'Johari', 'Philomena', 'Joseph'],
 'Sales': [233, 456, 421, 938, 234, 111]}

In [67]:
df = pd.DataFrame(data)

In [68]:
df

  company     Person  Sales
0    GOOG      Amani    233
1    GOOG       Tina    456
2    MSFT     Succes    421
3    MSFT     Johari    938
4      FB  Philomena    234
5      FB     Joseph    111

In [71]:
df.groupby("company")

* after running the above command, what i got was the grouby object and only shows me where its stored in memory

* So now let's store it as a new variable and see how it will turn out

In [72]:
byComp = df.groupby("company")

In [74]:
byComp.mean()

         Sales
company
FB       172.5
GOOG     344.5
MSFT     679.5

* So what happened above is, that we passed an aggregate function on our data. and it only proccessed ony those collumns with numbers only, and let out the strings alone!!

In [75]:
byComp.sum()

         Sales
company
FB         345
GOOG       689
MSFT      1359

In [76]:
byComp.std()

              Sales
company
FB        86.974134
GOOG     157.684812
MSFT     365.574206

* And i can even select some cells on this dataframe. For example ...

In [77]:
byComp.sum().loc["GOOG"]

Sales    689
Name: GOOG, dtype: int64

* In one line it can be done as folows

In [78]:
df.groupby("company").sum().loc["GOOG"]

Sales    689
Name: GOOG, dtype: int64

### .count( ) aggregate method

In [79]:
df.groupby("company").count()

         Person  Sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

* the above function counts all the instances of the individual company element

### .max( ) aggregate method

In [81]:
df.groupby("company").max()

            Person  Sales
company
FB       Philomena    234
GOOG          Tina    456
MSFT        Succes    938

In [82]:
df.groupby("company").min()

         Person  Sales
company
FB       Joseph    111
GOOG      Amani    233
MSFT     Johari    421

### .describe( ) aggregate method

The describe() method basically provides a summary of the data presented

In [83]:
df.groupby("company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  172.5   86.974134  111.0  141.75  172.5  203.25  234.0
GOOG      2.0  344.5  157.684812  233.0  288.75  344.5  400.25  456.0
MSFT      2.0  679.5  365.574206  421.0  550.25  679.5  808.75  938.0

* If you prefer each company to be a column, then we add a .transpose( ) function within it

In [84]:
df.groupby("company").describe().transpose()

company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   172.500000  344.500000  679.500000
      std     86.974134  157.684812  365.574206
      min    111.000000  233.000000  421.000000
      25%    141.750000  288.750000  550.250000
      50%    172.500000  344.500000  679.500000
      75%    203.250000  400.250000  808.750000
      max    234.000000  456.000000  938.000000

* We can also call specific column information as follows

In [88]:
df.groupby("company").describe().transpose()["FB"]

Sales  count      2.000000
       mean     172.500000
       std       86.974134
       min      111.000000
       25%      141.750000
       50%      172.500000
       75%      203.250000
       max      234.000000
Name: FB, dtype: float64

<h1 align = "center"> Merging, Joining, and  Concatenating <h1>

In [1]:
import pandas as pd

In [10]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                   index = [0,1,2,3]
                  )

In [11]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [12]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [13]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [14]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [15]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

 ### Concatenation 
Concatenation basically glues together DataFrames. Note that the dimensions must match along the axis you're trying to concatenate. You can use pd.concat and pass a list of DataFrames as follows

In [19]:
pd.concat([df1,df2,df3],axis=0).fillna(value="flled,later")

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11